{
	"format": "layers-model",
	"generatedBy": "keras v2.3.0-tf",
	"convertedBy": "TensorFlow.js Converter v2.3.0",
	"modelTopology": {
		"keras_version": "2.3.0-tf",
		"backend": "tensorflow",
		"model_config": {
			"class_name": "Sequential",
			"config": {
				"name": "sequential",
				"layers": [{
					"class_name": "LSTM",
					"config": {
						"name": "lstm",
						"trainable": true,
						"batch_input_shape": [null, 75, 98],
						"dtype": "float32",
						"return_sequences": true,
						"return_state": false,
						"go_backwards": false,
						"stateful": false,
						"unroll": false,
						"time_major": false,
						"units": 36,
						"activation": "relu",
						"recurrent_activation": "sigmoid",
						"use_bias": true,
						"kernel_initializer": {
							"class_name": "GlorotUniform",
							"config": {
								"seed": null
							}
						},
						"recurrent_initializer": {
							"class_name": "Orthogonal",
							"config": {
								"gain": 1.0,
								"seed": null
							}
						},
						"bias_initializer": {
							"class_name": "Zeros",
							"config": {}
						},
						"unit_forget_bias": true,
						"kernel_regularizer": null,
						"recurrent_regularizer": null,
						"bias_regularizer": null,
						"activity_regularizer": null,
						"kernel_constraint": null,
						"recurrent_constraint": null,
						"bias_constraint": null,
						"dropout": 0.0,
						"recurrent_dropout": 0.0,
						"implementation": 2
					}
				}, {
					"class_name": "Dropout",
					"config": {
						"name": "dropout",
						"trainable": true,
						"dtype": "float32",
						"rate": 0.2,
						"noise_shape": null,
						"seed": null
					}
				}, {
					"class_name": "LSTM",
					"config": {
						"name": "lstm_1",
						"trainable": true,
						"dtype": "float32",
						"return_sequences": false,
						"return_state": false,
						"go_backwards": false,
						"stateful": false,
						"unroll": false,
						"time_major": false,
						"units": 36,
						"activation": "relu",
						"recurrent_activation": "sigmoid",
						"use_bias": true,
						"kernel_initializer": {
							"class_name": "GlorotUniform",
							"config": {
								"seed": null
							}
						},
						"recurrent_initializer": {
							"class_name": "Orthogonal",
							"config": {
								"gain": 1.0,
								"seed": null
							}
						},
						"bias_initializer": {
							"class_name": "Zeros",
							"config": {}
						},
						"unit_forget_bias": true,
						"kernel_regularizer": null,
						"recurrent_regularizer": null,
						"bias_regularizer": null,
						"activity_regularizer": null,
						"kernel_constraint": null,
						"recurrent_constraint": null,
						"bias_constraint": null,
						"dropout": 0.0,
						"recurrent_dropout": 0.0,
						"implementation": 2
					}
				}, {
					"class_name": "Dropout",
					"config": {
						"name": "dropout_1",
						"trainable": true,
						"dtype": "float32",
						"rate": 0.2,
						"noise_shape": null,
						"seed": null
					}
				}, {
					"class_name": "Dropout",
					"config": {
						"name": "dropout_2",
						"trainable": true,
						"dtype": "float32",
						"rate": 0.2,
						"noise_shape": null,
						"seed": null
					}
				}, {
					"class_name": "Dense",
					"config": {
						"name": "dense",
						"trainable": true,
						"dtype": "float32",
						"units": 4,
						"activation": "softmax",
						"use_bias": true,
						"kernel_initializer": {
							"class_name": "GlorotUniform",
							"config": {
								"seed": null
							}
						},
						"bias_initializer": {
							"class_name": "Zeros",
							"config": {}
						},
						"kernel_regularizer": null,
						"bias_regularizer": null,
						"activity_regularizer": null,
						"kernel_constraint": null,
						"bias_constraint": null
					}
				}],
				"build_input_shape": [null, 75, 98]
			}
		},
		"training_config": {
			"loss": "sparse_categorical_crossentropy",
			"metrics": ["accuracy"],
			"weighted_metrics": null,
			"loss_weights": null,
			"sample_weight_mode": null,
			"optimizer_config": {
				"class_name": "Adam",
				"config": {
					"name": "Adam",
					"learning_rate": 0.0010000000474974513,
					"decay": 9.999999747378752e-06,
					"beta_1": 0.8999999761581421,
					"beta_2": 0.9990000128746033,
					"epsilon": 1e-07,
					"amsgrad": false
				}
			}
		}
	},
	"weightsManifest": [{
		"paths": ["group1-shard1of1.bin"],
		"weights": [{
			"name": "dense/kernel",
			"shape": [36, 4],
			"dtype": "float32"
		}, {
			"name": "dense/bias",
			"shape": [4],
			"dtype": "float32"
		}, {
			"name": "lstm/lstm_cell/kernel",
			"shape": [98, 144],
			"dtype": "float32"
		}, {
			"name": "lstm/lstm_cell/recurrent_kernel",
			"shape": [36, 144],
			"dtype": "float32"
		}, {
			"name": "lstm/lstm_cell/bias",
			"shape": [144],
			"dtype": "float32"
		}, {
			"name": "lstm_1/lstm_cell_1/kernel",
			"shape": [36, 144],
			"dtype": "float32"
		}, {
			"name": "lstm_1/lstm_cell_1/recurrent_kernel",
			"shape": [36, 144],
			"dtype": "float32"
		}, {
			"name": "lstm_1/lstm_cell_1/bias",
			"shape": [144],
			"dtype": "float32"
		}]
	}]
}